Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/married_couples/marital_status_and_inheritance.html.txt.tmx
Source language: en
Languages: ga

source: Your civil status affects your rights to inherit from your spouse/partner
ga: Imríonn do stádas sibhialta tionchar ar do chearta chun oidhreacht a fháil ó do chéile/pháirtnéir

source: Spouses and civil partners have the same legal right to inherit and the same rights on intestacy
ga: Tá an ceart céanna dlíthiúil ag céilí agus ag páirtnéirí sibhialta chun oidhreacht a fháil agus bíonn na cearta céanna acu maidir le díthiomnacht

source: A will is automatically revoked when you marry unless it was made in contemplation of that marriage
ga: Déantar uacht a aisghairm go huathoibríoch nuair a phóstar thú, mura ndearnadh í in oirchill an phósta sin

source: A bequest in a will to a person who is a witness to the will or to that person’s spouse is void
ga: Tá tiomnacht in uacht le duine atá mar fhinné leis an uacht nó le céile an duine sin ar neamhní

source: If you are not married, you may only inherit from your partner if you are left a bequest in a valid will
ga: Muna bhfuil tú pósta, ní féidir leat oidhreacht a fháil ó do pháirtí muna bhfágann sé/sí tiomnacht agat in uacht bhailí

source: However, a spouse is entitled to what is called a "legal right share" of their deceased spouse's estate even if:
ga: Ach, tá céile i dteideal oidhreachta ar a dtugtar "sciar dleathúil" d'eastát a c(h)éile básaithe fiú:

source: • there is no will
ga: • muna bhfuil aon uacht ann

source: • the will is invalid
ga: • má tá an uacht bhailí

source: • there is a valid will, but it leaves little or nothing to the surviving spouse
ga: • má tá uacht bhailí ann, ach go bhfuil fiorbheagán nó tada fágtha ag an gcéile beo

source: The marital status of the deceased person may also indirectly affect the inheritance rights of his/her children
ga: D'fhéadfadh sé go mbeadh tionchar indíreach ag stádas pósta an duine básaithe ar chearta oidhreacha a c(h)uid páistí

source: The amount of the surviving spouse's legal right share depends on two factors:
ga: Braitheann sciar dleathúil an chéile bheo ar dhá rud:

source: • whether or not there is a valid will
ga: • an bhfuil uacht bhailí ann

source: • whether or not the deceased spouse has any children
ga: • an bhfuil aon pháistí ag an gcéile a bhásaigh

source: You are entitled to the whole estate if:
ga: Tá tú i dteideal an eastáit ar fad:

source: • there is no will or the will is invalid, and
ga: • muna bhfuil aon uacht ann nó muna bhfuil an uacht bhailí, agus

source: • the deceased spouse has no children or grandchildren
ga: • muna bhfuil aon pháistí ná garpháistí ag an gcéile básaithe

source: You are entitled to two-thirds of the estate if:
ga: Tá tú i dteideal dhá thrian den eastát:

source: • there is no valid will, and
ga: • muna bhfuil aon uacht bhailí ann, agus

source: • the deceased spouse has children or grandchildren
ga: • má tá páistí nó garpháistí ag an gcéile básaithe

source: You are entitled to one-half of the estate if:
ga: Tá tú i dteideal leath an eastáit:

source: • there is a valid will, and
ga: • má tá uacht bhailí ann, agus

source: You are entitled to one-third of the estate if:
ga: Tá tú i dteideal trian den eastát:

source: If you are the surviving spouse, you must be informed of this right and should apply for your legal right share as soon as possible
ga: Más tú an céile atá beo ba cheart an ceart seo a chur in iúl duit agus ba cheart duit iarratas a dhéanamh ar an bpointe ar do sciar dleathúil

source: You may require that the family home be given to you in satisfaction of your legal right share, even if the home was left to another person under the will
ga: D'fhéadfadh sé go ndéanfadh tú éileamh ar theach an teaghlaigh a fháil mar do sciar dleathúil, fiú má fágadh an teach chuig duine eile san uacht

source: If the family home is worth more than the legal right share, you will normally have to pay the difference into the deceased's estate
ga: Más fiú níos mó ná do sciar dleathúil é teach an teaghlaigh go hiondúil beidh ort an fuílleach a íoc le heastát an té atá básaithe

source: However, in cases of hardship, you may apply to the court to have the dwelling house given to you either without paying the difference or by paying such sum as the court thinks reasonable
ga: Ach, i gcásanna crua is féidir iarratas a dhéanamh chuig an gcúirt go dtabharfaí an teach cónaithe duit tríd an bhfuílleach a íoc nó suim eile a cheapann an Chúirt a bheith réasunta

source: Both marital and non-marital children have equal rights to inherit from their parents
ga: Tá na cearta oidhreachta céanna óna thuismitheoirí ag páistí a rugadh taobh istigh agus taobh amuigh den phósadh

source: However, non-marital children may have the additional burden of having to prove paternity if it is disputed
ga: Ach, d'fhéadfadh sé go mbeadh an fhadhb bhreise ag páistí a rugadh taobh amuigh de phósadh atharthacht a chruthú má tá easaontas ann

source: Children's inheritance rights may be affected by their deceased parent's marital status
ga: D'fhéadfadh stádas pósta a dtuismitheora tionchar a bheith aige ar chearta oidhreacha páistí

source: The children (minor and adult) are entitled to the entire estate divided equally between them if:
ga: Tá páistí (faoi aois nó fásta) i dteideal eastát iomlán a dtuismitheora roinnte go cothrom eatarthu:

source: • the deceased parent is not married or his/her spouse is already dead
ga: • muna bhfuil an tuismitheoir a bhásaigh pósta agus/nó má tá a c(h)éile básaithe cheana

source: But the children are only entitled to one-third of the estate divided equally between them if:
ga: Níl na páistí i dteideal ach aon trian den eastát roinnte go cothrom eatarthu:

source: • the deceased parent is married and is survived by his/her spouse
ga: • muna bhfuil aon uacht ann nó muna bhfuil an uacht bhailí, agus

source: However, if a child considers that he/she has not been adequately provided for, he/she may make an application to court
ga: • má tá an tuismitheoir a bhásaigh pósta agus má tá a c(h)éile fós beo
